[
  {
    "slug": "pertempuran-laut-aru-1962",
    "title": "Pertempuran Laut Aru",
    "date": "1962-01-15",
    "shortDescription": "Momen gugurnya Komodor Yos Sudarso dalam perjuangan merebut Irian Barat lewat Operasi Trikora. Diperingati sebagai Hari Dharma Samudera.",
    "description": "Tepat pada hari ini Kamis, (15/1/2024), diperingati sebagai Hari Dharma Samudera. Hari Dharma Samudera adalah hari penting nasional yang diperingati untuk mengenang sejarah. Pertempuran Laut Aru yang terjadi pada tanggal 15 Januari 1962 silam.\n\nPertempuran Laut Aru merupakan salah satu peristiwa penting dalam sejarah perjuangan Indonesia untuk merebut kembali Irian Barat (Papua) dari tangan Belanda. Peristiwa ini terjadi pada 15 Januari 1962 di perairan Laut Aru, bagian dari Laut Banda, Maluku.\n\nLatar Belakang Terjadinya Pertempuran Laut Aru\nKala itu, Indonesia baru beberapa tahun merdeka, tetapi Belanda masih menguasai wilayah Irian Barat (sekarang Papua). Pemerintah Indonesia menolak hal itu karena wilayah Irian Barat merupakan bagian dari Negara Kesatuan Republik Indonesia. Untuk merebut kembali wilayah tersebut, Presiden Soekarno pada 19 Desember 1961 mengumumkan Operasi Trikora (Tri Komando Rakyat).\n\nPenyebab terjadinya pertempuran itu dikarenakan Belanda mengingkari hasil dari Konferensi Meja Bundar (KMB). Hal itu membuat Presiden Soekarno melantangkan Operasi Tri Komando Rakyat (Trikora) pada tanggal 19 Desember 1962 di Yogyakarta. isi trikora tersebut berbunyi :\nGagalkan pembentukan \"Negara Boneka Papua\" buatan Belanda kolonial\nKibarkan Sang Merah Putih di Irian Barat Tanah Air Indonesia\nBersiaplah untuk mobilisasi umum guna mempertahankan kemerdekaan dan kesatuan Tanah Air Bangsa.\n\nAkibat dari Pertempuran Laut Aru :\nGugurnya Komodor Yos Sudarso dan sejumlah prajurit Angkatan Laut Indonesia.\nMeningkatnya semangat nasionalisme rakyat Indonesia, yang membuat perjuangan merebut Irian Barat semakin kuat.\nMunculnya tekanan internasional terhadap Belanda, sehingga akhirnya Irian Barat diserahkan kepada Indonesia pada tahun 1963.",
    "imageURL": "../img/Januari.jpeg",
    "category": "Konfrontasi",
    "tags": ["Laut Aru", "Trikora", "Yos Sudarso", "1962", "Irian Barat", "Hari Dharma Samudera"],
    "quote": "Gagalkan pembentukan \"Negara Boneka Papua\" buatan Belanda kolonial. Kibarkan Sang Merah Putih di Irian Barat Tanah Air Indonesia. Bersiaplah untuk mobilisasi umum guna mempertahankan kemerdekaan dan kesatuan Tanah Air Bangsa.",
    "location": "Perairan Laut Aru, Laut Banda, Maluku",
    "isCollage": true, 
    "galleryImages": [
      "https://www.pantau.com/_next/image?url=https%3A%2F%2Fpantau.sgp1.cdn.digitaloceanspaces.com%2Fimages%2F20250114-4446-pertempuarn-laut-aru-1607373185.jpg&w=1200&q=75", 
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwmYHYgyLdVB1Mz62TOI51PiNfo-LjjtCabg&s",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKumUzpb8deNRS9CPwIc0nDYVqfZAnuWEYAQ&s"
    ]
  },
  {
    "slug": "pemberontakan-peta-blitar-1945",
    "title": "Pemberontakan PETA di Blitar",
    "date": "1945-02-14",
    "shortDescription": "Perlawanan besar pertama tentara lokal Indonesia (PETA) yang dipimpin Shodancho Supriyadi melawan pendudukan Jepang.",
    "description": "Bulan Februari menjadi saksi perjuangan para pahlawan bangsa dalam Pemberontakan PETA di Blitar. Pada tanggal 14 Februari 1945, para anggota PETA yang dipimpin oleh Shodancho Supriyadi bangkit melawan kekuasaan Jepang. Perlawanan ini lahir dari rasa cinta tanah air dan tekad kuat untuk membebaskan Indonesia dari penjajahan.\nLatar Belakang Terjadinya Pemberontakan PETA di Blitar : \nPada masa pendudukan Jepang (1942–1945), Jepang membentuk organisasi militer bernama PETA (Pembela Tanah Air). Tujuannya adalah melatih pemuda-pemuda Indonesia agar siap membantu Jepang melawan Sekutu. Namun, seiring waktu, para anggota PETA menyadari bahwa Jepang hanyalah penjajah baru yang menindas rakyat dengan kerja paksa (romusha), kekerasan, dan perlakuan tidak manusiawi. Kekecewaan dan penderitaan rakyat inilah yang mendorong munculnya semangat untuk melawan penjajahan.\n\nPenyebab Terjadinya Pemberontakan\nKekejaman Jepang yang menindas rakyat dan pasukan PETA sendiri.\nRasa nasionalisme yang makin kuat di kalangan anggota PETA — mereka ingin Indonesia merdeka, bukan sekadar membantu penjajah.\nPengaruh tokoh Supriyadi, pemimpin muda yang berani dan menjadi panutan bagi anak buahnya.\nKekecewaan terhadap janji Jepang, yang katanya ingin memajukan Asia, tapi nyatanya hanya memanfaatkan Indonesia.\nJadi, pemberontakan ini muncul dari kombinasi antara penderitaan rakyat dan semangat kemerdekaan.\n\nAkibat dari Pemberontakan PETA :\nPemberontakan PETA di Blitar memang tidak berhasil menggulingkan kekuasaan Jepang, namun meninggalkan dampak besar bagi perjuangan bangsa Indonesia.\nBanyak prajurit PETA ditangkap dan dihukum oleh Jepang.\nBeberapa perwira yang terlibat bahkan dieksekusi mati, sementara lainnya dipenjara.\nMeski begitu, semangat juang mereka tidak pernah padam.\nRakyat Indonesia semakin sadar bahwa Jepang hanyalah penjajah baru.\nHal ini membangkitkan semangat nasionalisme dan memperkuat tekad untuk merdeka.\nLahirnya tokoh-tokoh pejuang bangsa dari kalangan PETA.\nBanyak di antara mereka yang kelak menjadi tokoh penting dalam perjuangan kemerdekaan dan pembentukan Tentara Nasional Indonesia (TNI).\nTokoh-tokoh tersebut antara lain:\nSupriyadi → Pemimpin pemberontakan, dikenal pemberani dan berjiwa nasionalis tinggi.\nGatot Soebroto → Perwira PETA yang kemudian menjadi tokoh penting dalam TNI dan nasionalisme Indonesia.\nR. Suprapto → Salah satu anggota PETA yang kemudian aktif dalam perjuangan kemerdekaan.\nSudirman → Walau tidak terlibat langsung dalam pemberontakan Blitar, beliau juga mantan anggota PETA yang kelak menjadi Panglima Besar TNI.\nSemangat perjuangan PETA menjadi inspirasi bagi generasi pejuang kemerdekaan.\nPeristiwa ini memperlihatkan bahwa rakyat Indonesia siap berkorban demi kemerdekaan bangsanya.\nMenjadi cikal bakal lahirnya Tentara Nasional Indonesia (TNI).\nSetelah Jepang kalah dan Indonesia merdeka, para mantan anggota PETA berperan penting dalam membentuk pasukan pertahanan nasional.",
    "imageURL": "../img/blitar.jpg",
    "category": "Pergerakan Nasional",
    "tags": ["PETA", "Supriyadi", "Blitar", "Jepang", "1945", "TNI"],
    "quote": "Perlawanan ini lahir dari rasa cinta tanah air dan tekad kuat untuk membebaskan Indonesia dari penjajahan.",
    "location": "Blitar",
    "isCollage": true, 
    "galleryImages": [
      "https://blue.kumparan.com/image/upload/fl_progressive,fl_lossy,c_fill,f_auto,q_auto:best,w_640/v1634025439/01hqsesavnfpaex8pd401hspw9.jpg", 
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRyAj7Ce6vzAj4c0bg_mKa9_SeZrymaK6JnXg&s",
      "https://img.inews.co.id/media/420/files/inews_new/2021/10/27/film_peta.jpg"
    ]
  },
  {
    "slug": "bandung-lautan-api-1946",
    "title": "Bandung Lautan Api & MUHAMMAD TOHA",
    "date": "1946-03-24",
    "shortDescription": "Aksi pembumihangusan (strategi scorched earth) Kota Bandung oleh rakyat dan TKR pada 24 Maret 1946, ditandai pengorbanan heroik Mohammad Toha.",
    "description": "BANDUNG LAUTAN API\n\nSejarah dan Latar Belakang\nPeristiwa Bandung Lautan Api terjadi pada 23–24 Maret 1946 di Kota Bandung, Jawa Barat. Kejadian ini merupakan salah satu peristiwa penting dalam sejarah perjuangan mempertahankan kemerdekaan Indonesia. Setelah Proklamasi Kemerdekaan 17 Agustus 1945, pasukan Sekutu yang tergabung dalam Allied Forces Netherlands East Indies (AFNEI) datang ke Indonesia dengan alasan membebaskan tawanan Jepang. Namun kenyataannya, mereka juga membawa serta Netherlands Indies Civil Administration (NICA) yang bertujuan mengembalikan kekuasaan Belanda di Indonesia.\nKehadiran pasukan tersebut memicu ketegangan antara rakyat dan tentara Indonesia di satu pihak dengan Sekutu dan NICA di pihak lain. Di Bandung, situasi semakin panas karena Sekutu menuntut agar rakyat dan Tentara Keamanan Rakyat (TKR) menyerahkan senjata serta meninggalkan beberapa wilayah strategis kota.\n\nPemicu dan Awal Ketegangan\nPada 24 November 1945, pasukan Indonesia melakukan serangan terhadap markas Sekutu di Bandung Utara.\nMenyusul pertempuran itu, situasi menjadi semakin genting dan Sekutu mengeluarkan ultimatum agar pasukan Indonesia meninggalkan Bandung Selatan.\nUltimatum resmi datang pada 17 Maret 1946, dari Letnan Jenderal Montagu Stopford, Panglima AFNEI di Jakarta. Ia memerintahkan agar pasukan Indonesia mundur sejauh 11 kilometer dari pusat kota Bandung.\nPemerintah Indonesia melalui Perdana Menteri Soetan Sjahrir menyarankan pasukan untuk mundur secara taktis demi menghindari korban lebih banyak, tetapi para pejuang di Bandung menolak kota mereka dikuasai musuh.\n\nKeputusan Pembumihangusan Kota\nMenanggapi ultimatum tersebut, Kolonel A.H. Nasution, Panglima Divisi III TKR, mengeluarkan perintah penting:\nWarga Bandung Selatan harus dievakuasi.\nKota harus dibumihanguskan, agar tidak dapat dimanfaatkan oleh pasukan Sekutu dan NICA.\nPerintah ini dilaksanakan pada malam 24 Maret 1946. Ribuan warga meninggalkan rumah mereka menuju arah selatan luar kota sejauh 11 km. Setelah proses evakuasi dimulai, para pejuang dan warga mulai membakar rumah, gudang, pabrik, serta bangunan strategis milik mereka sendiri.\nSekitar pukul 20.00 malam, ledakan dinamit di salah satu gudang mempercepat penyebaran api. Dalam waktu singkat, api menjalar ke berbagai penjuru kota dan Bandung pun berubah menjadi lautan api. Cahaya merah membara terlihat dari kejauhan, menandai semangat perlawanan rakyat Bandung.\nTokoh-Tokoh Penting\nBeberapa tokoh yang berperan besar dalam peristiwa ini antara lain:\nA.H. Nasution – Panglima Divisi III TKR yang mengeluarkan perintah pembumihangusan dan evakuasi.\n \nSoetan Sjahrir – Perdana Menteri Indonesia yang memerintahkan taktik mundur secara strategis.\n \nMohammad Toha – Pejuang muda yang terkenal karena meledakkan gudang amunisi milik Sekutu di Dayeuhkolot. \n\n\nDidi Kartasasmita – Panglima Komando Jawa Barat yang ikut mengoordinasikan gerakan perlawanan.\n sumber:Merdeka.com\nMakna dan Dampak\nBandung Lautan Api menjadi simbol semangat perjuangan, pengorbanan, dan cinta tanah air rakyat Indonesia.\nMeski kota terbakar dan ribuan warga kehilangan tempat tinggal, tindakan ini dianggap strategi militer yang tepat karena menghalangi Sekutu memanfaatkan fasilitas Bandung.\nSetelah peristiwa itu, pasukan Indonesia melanjutkan perjuangan dengan taktik gerilya dari luar kota.\nSemangat peristiwa ini juga diabadikan dalam lagu patriotik “Halo-Halo Bandung”, yang melambangkan kerinduan untuk merebut kembali kota tercinta.\n\nKesimpulan\nPeristiwa Bandung Lautan Api menunjukkan bahwa rakyat Indonesia lebih memilih mengorbankan harta dan tempat tinggal daripada melihat tanah air mereka kembali dikuasai penjajah. Dengan keberanian dan solidaritas, warga Bandung menjadikan kota mereka sebagai simbol perlawanan terhadap kolonialisme.\n\nMUHAMMAD TOHA\n \n\nLatar Belakang & Kehidupan Awal\n\nMohammad Toha lahir di Bandung tahun 1927, dari pasangan Suganda dan Nariah. Saat Toha masih kecil, ayahnya meninggal tahun 1929, dan kemudian ibunya menikah lagi dengan pamannya, Sugandi. Setelah perceraian pernikahan kedua, ia diasuh oleh kakek-neneknya, Jahiri dan Oneng. \nPada usia tujuh tahun, Toha mulai bersekolah di Volk School (Sekolah Rakyat) hingga kelas 4 SD. Sekolahnya terhenti ketika pecahnya Perang Dunia II yang mengganggu pendidikan dan aktivitas di masa pendudukan Jepang. \nSelama masa pendudukan Jepang, Toha ikut menjadi anggota pasukan “Seinendan” (organisasi pemuda Jepang) dan bekerja sebagai montir kendaraan militer Jepang—menjadikannya terampil dalam bahasa Jepang dan mekanik mobil/motor. \n\nKeterlibatan dalam Perjuangan Kemerdekaan\nSetelah kemerdekaan Indonesia, Toha bergabung dengan organisasi milisi pemuda di Bandung yaitu Barisan Rakyat Indonesia (BRI) yang dipimpin oleh pamannya, Ben Alamsyah. Organisasi ini kemudian bergabung dengan badan perjuangan lain hingga terbentuknya Barisan Banteng Rakyat Indonesia (BBRI). Dalam BBRI, Toha menjabat sebagai Komandan Seksi I Bagian Penggempur. \nKemampuan mekanik dan keberanian fisiknya menjadi modal penting saat konflik dengan pasukan Sekutu/NICA. \n\nAksi Heroik: Ledakan Gudang Amunisi di Dayeuh Kolot\nSaat peristiwa Bandung Lautan Api (23-24 Maret 1946) berlangsung, Toha mengambil peran penting dalam strategi “bumi-hangus” di Bandung Selatan. Ia ditugaskan untuk meledakkan gudang amunisi musuh di Dayeuh Kolot yang menyimpan sekitar 1.100 ton mesiu dan senjata.\nLedakan itu sangat besar sehingga memiliki dampak nasional: memporak-porandakan pasokan amunisi musuh di Priangan sehingga mengganggu operasi pasukan NICA. Meski dalam ledakan tersebut tidak banyak korban Belanda, kerugian materinya sangat besar. \nDalam aksi tersebut, Toha gugur—mengorbankan nyawanya demi agar Bandung tidak bisa digunakan oleh musuh.\n\nSuka & Duka di Balik Kisahnya\nSuka: Aksi Toha menjadi simbol keberanian dan pengorbanan. Ia meninggalkan kehidupan normal-nya, menjadi pejuang aktif, dan mengambil risiko besar demi bangsa.\nDuka: Keterlibatannya membawa konsekuensi berat—ia kehilangan nyawa muda, meninggalkan keluarga, serta hidup-kelahirannya hanya menjadi bagian catatan sejarah.\nMeski begitu, pengorbanan tersebut tidak sia-sia karena memberi dampak strategis dalam perjuangan Bandung.\n\nWarisan & Penghargaan\nNamanya diabadikan oleh warga Bandung melalui:\nMonumen Mohammad Toha di Dayeuh Kolot, Kabupaten Bandung.\nSalah satu jalan utama di Bandung diberi nama Jalan Mohammad Toha.\nCerita keberaniannya menjadi bagian dari narasi lokal yang menginspirasi generasi muda di Bandung dan sekitarnya.\n\nCatatan Kritis\nMeskipun aksi heroiknya sangat diapresiasi, terdapat perbedaan sumber terkait banyak detil: jumlah persis amunisi yang dihancurkan, kondisi persis saat ledakan, serta pengakuan resmi status “pahlawan nasional”. Artikel menyebut bahwa meskipun belum semua aspek secara formal diakui, Toha tetap dihormati sebagai pahlawan lokal.\nPeristiwa ini juga mengingatkan kita bahwa setiap tindakan besar sering dibarengi dengan risiko dan pengorbanan pribadi yang tak terlihat dalam catatan besar sejarah.",
    "imageURL": "../img/maret/2.jpg",
    "category": "Perjuangan Kemerdekaan",
    "tags": ["Bandung Lautan Api", "1946", "Maret", "A.H. Nasution", "Mohammad Toha", "Bumi Hangus", "Jawa Barat"],
    "quote": "Peristiwa Bandung Lautan Api menunjukkan bahwa rakyat Indonesia lebih memilih mengorbankan harta dan tempat tinggal daripada melihat tanah air mereka kembali dikuasai penjajah.",
    "location": "Kota Bandung, Jawa Barat",
    "isCollage": true, 
    "galleryImages": [
      "../img/maret/1.jpg", 
      "/img/maret/3.jpg",
      "/img/maret/4.jpg"
    ]
  },
  {
    "slug": "hari-kartini-1879",
    "title": "Hari Kartini",
    "date": "1879-04-21",
    "shortDescription": "Peringatan hari kelahiran Raden Ajeng Kartini, pelopor emansipasi wanita Indonesia dan pendiri sekolah untuk perempuan pribumi.",
    "description": "Raden Ajeng Kartini adalah pahlawan nasional Indonesia yang dikenal sebagai pelopor emansipasi wanita, lahir di Jepara pada 21 April 1879. Perjuangan utamanya adalah memperjuangkan pendidikan dan kesetaraan hak bagi perempuan, yang diwujudkan melalui surat-suratnya yang kemudian dibukukan menjadi karya terkenal \"Habis Gelap Terbitlah Terang\". Ia meninggal muda pada 17 September 1904 setelah melahirkan putra pertamanya, tetapi pemikirannya terus menginspirasi hingga kini. \n\nBiografi singkat\nLahir: 21 April 1879 di Jepara, Jawa Tengah.\nKeluarga: Anak dari Raden Adipati Sosroningrat, seorang Bupati Jepara.\nPendidikan: Sempat mengenyam pendidikan di Europeesche Lagere School (ELS) di Jepara. Setelah itu, ia harus menjalani pingitan dan belajar di rumah.\nPernikahan: Menikah dengan KRM Adipati Aro Singgih Jojo Adiningrat, Bupati Rembang, pada tahun 1903.\nMeninggal: Wafat pada 17 September 1904 di usia 25 tahun, empat hari setelah melahirkan putranya, Soesalit Djojoadhiningrat. \n\nPerjuangan dan Pemikiran\nEmansipasi Wanita: Kartini memperjuangkan agar perempuan memiliki hak yang sama dengan laki-laki, terutama dalam bidang pendidikan.\nPerjuangan melalui surat: Melalui surat-suratnya kepada teman-temannya di Belanda, ia mengkritik adat istiadat yang membatasi perempuan dan menyuarakan visinya tentang kemajuan wanita.\nSekolah: Meskipun terpaksa menjalani pingitan, ia tetap membuka sekolah untuk perempuan dan mengajarkan membaca, menulis, berhitung, serta keterampilan lainnya.\n\"Habis Gelap Terbitlah Terang\": Buku ini berisi kumpulan surat Kartini, yang pertama kali diterbitkan pada tahun 1911 dengan judul \"Door Duisternis tot Licht\" dan kemudian diterjemahkan menjadi \"Habis Gelap Terbitlah Terang\". Buku ini menjadi inspirasi bagi banyak orang untuk memperjuangkan hak-hak perempuan. \n\nWarisan dan Kontribusi\nHari Kartini: Sejak tahun 1964, tanggal lahirnya, 21 April, ditetapkan sebagai Hari Kartini untuk mengenang jasa-jasanya.\nSekolah Kartini: Semangatnya menginspirasi pendirian sekolah-sekolah Kartini di berbagai kota sebagai kelanjutan dari perjuangannya.\nSimbol: Kartini menjadi simbol semangat dan keberanian perempuan Indonesia yang membuka jalan bagi pendidikan dan hak-hak perempuan di masa depan.",
    "imageURL": "../img/april/2.webp",
    "category": "Tokoh Nasional",
    "tags": ["RA Kartini", "Emansipasi Wanita", "Habis Gelap Terbitlah Terang", "21 April", "Jepara"],
    "quote": "Banyak hal yang bisa menjatuhkanmu, namun satu-satunya hal yang benar-benar dapat menjatuhkanmu adalah sikapmu sendiri.",
    "location": "Jepara, Jawa Tengah",
    "isCollage": true, 
    "galleryImages": [
      "../img/april/1.jpeg",
      "https://www.zenius.net/blog/content/images/wordpress/2021/04/ra-kartini-zenius-education.jpg",
      "https://images.tokopedia.net/img/JFrBQq/2022/4/21/d6280ed9-5c90-47a1-80bc-eba210f4a46d.jpg"
    ]
  },
 {
    "slug": "hari-kebangkitan-nasional-1908",
    "title": "Hari Kebangkitan Nasional",
    "date": "1908-05-20",
    "shortDescription": "Peringatan berdirinya organisasi Boedi Oetomo pada tahun 1908, menandai dimulainya era kesadaran nasional dan perjuangan modern kemerdekaan Indonesia.",
    "description": "Hari Kebangkitan Nasional diperingati setiap tanggal 20 Mei untuk menandai hari berdirinya organisasi Boedi Oetomo (Budi Utomo) pada tahun 1908. Pendirian Boedi Oetomo di Batavia (sekarang Jakarta) oleh para mahasiswa School tot Opleiding van Inlandsche Artsen (STOVIA), dipimpin oleh Dr. Soetomo, serta didorong oleh dr. Wahidin Soedirohoesodo, dianggap sebagai tonggak awal kesadaran nasional dan dimulainya perjuangan kemerdekaan Indonesia secara modern.\n\nSebelum tahun 1908, perjuangan melawan penjajah umumnya bersifat kedaerahan dan mengandalkan kekuatan fisik. Boedi Oetomo memperkenalkan pendekatan baru, yaitu melalui pendidikan, budaya, dan organisasi. Tujuan utama organisasi ini adalah memajukan pendidikan dan kebudayaan di kalangan bumiputra, yang pada akhirnya memicu semangat persatuan dan nasionalisme di seluruh Nusantara.\n\nOrganisasi ini tidak secara langsung menuntut kemerdekaan politik pada awalnya, namun fokus pada peningkatan kualitas sumber daya manusia melalui pendidikan agar bangsa Indonesia mampu berjuang untuk hak-haknya. Peran Boedi Oetomo sangat krusial karena berhasil mengubah pola perjuangan dari yang bersifat fisik dan lokal menjadi perjuangan yang terorganisir, politis, dan mencakup seluruh bangsa. Inilah yang kemudian dianggap sebagai 'Kebangkitan Nasional' atau bangkitnya kesadaran sebagai satu bangsa.\n\nPeristiwa Penting\n* 20 Mei 1908: Tanggal pendirian Boedi Oetomo.\n* Pendiri: Dr. Soetomo dan kawan-kawan mahasiswa STOVIA, dengan inspirator utama dr. Wahidin Soedirohoesodo.\n* Tujuan Awal: Memajukan pengajaran dan kebudayaan, khususnya bagi penduduk bumiputra.\n* Dampak: Menginspirasi berdirinya organisasi-organisasi pergerakan nasional lainnya dan menyebarkan semangat persatuan di kalangan kaum terpelajar.\n\nWarisan dan Makna\nPenetapan tanggal 20 Mei sebagai Hari Kebangkitan Nasional oleh Presiden Soekarno pada tahun 1959 adalah untuk menghormati dan mengenang semangat persatuan, kesadaran berbangsa, dan awal mula perjuangan modern yang dicetuskan oleh Boedi Oetomo. Peringatan ini menjadi pengingat bagi seluruh rakyat Indonesia akan pentingnya persatuan, kerja keras, dan pendidikan dalam mengisi kemerdekaan dan menghadapi tantangan bangsa.",
    "imageURL": "https://cdn1-production-assets-kly.akamaized.net/medias/881128/big/045149900_1432122461-1.jpg",
    "category": "Peristiwa Nasional",
    "tags": ["Boedi Oetomo", "Budi Utomo", "20 Mei", "Pergerakan Nasional", "Dr. Soetomo", "Nasionalisme"],
    "quote": "Tiap-tiap bangsa harus bangkit dari tidurnya, supaya ia dapat berdiri sendiri dan bekerja untuk keperluan sendiri.",
    "location": "Batavia (Jakarta)",
    "isCollage": true,
    "galleryImages": [
      "https://cdn0-production-images-kly.akamaized.net/qyrhF1ZfttNI_Fxu6e4gpQmLqZg=/469x260/smart/filters:quality(75):strip_icc():format(webp)/kly-media-production/medias/881213/original/092621200_1432126258-Untitled-3.gif",
      "https://disdik.grobogan.go.id/images/Mei_2021/5e5916aa0797c.png",
      "https://elshinta.com/asset/upload/article/2022/mei/9196_ELSHINTADOTCOM_20220518_momentum-harkitnas-di-masa-revolusi-2izifwprrj.jpg"
    ]
},
{
    "slug": "piagam-jakarta-22-juni-1945",
    "title": "Perumusan Piagam Jakarta (Cikal Bakal UUD 1945)",
    "date": "1945-06-22",
    "shortDescription": "Naskah bersejarah yang dirumuskan oleh Panitia Sembilan BPUPKI, menjadi cikal bakal Pembukaan UUD 1945 dan rumusan awal Pancasila, yang mencerminkan kompromi antara golongan nasionalis dan Islam.",
    "description": "Piagam Jakarta, yang dalam bahasa Belanda disebut Jakarta Charter, adalah dokumen yang sangat penting dalam sejarah perumusan dasar negara Indonesia, Pancasila, dan kerangka konstitusi. Naskah ini merupakan hasil kerja keras Panitia Sembilan, sebuah panitia kecil yang dibentuk oleh Badan Penyelidik Usaha-Usaha Persiapan Kemerdekaan Indonesia (BPUPKI) setelah sidang pertama yang berlangsung pada tanggal 29 Mei - 1 Juni 1945.\n\nLatar Belakang Pembentukan dan Tujuan\nSetelah sidang pertama BPUPKI selesai, terdapat perbedaan pandangan yang signifikan mengenai dasar negara, terutama menyangkut hubungan antara agama (Islam) dan negara. Untuk menjembatani perbedaan pandangan dan mencapai kesepakatan nasional ini, BPUPKI membentuk Panitia Kecil yang kemudian berkembang menjadi Panitia Sembilan pada 22 Juni 1945. Tugas utama panitia ini adalah menyusun rumusan dasar negara yang final dan dapat diterima oleh semua pihak agar persiapan kemerdekaan dapat dilanjutkan tanpa hambatan internal.\n\nAnggota Panitia Sembilan\nPanitia Sembilan terdiri dari tokoh-tokoh kunci dari dua kubu utama, yaitu lima orang dari golongan nasionalis dan empat orang dari golongan Islam. Anggotanya meliputi: Ir. Soekarno (Ketua), Drs. Mohammad Hatta (Wakil Ketua), Mr. Achmad Soebardjo, Mr. Mohammad Yamin, Mr. A.A. Maramis (mewakili golongan Nasionalis); serta K.H. Wachid Hasjim, Abdul Kahar Muzakir, H. Agus Salim, dan Abikoesno Tjokrosoejoso (mewakili golongan Islam).\n\nIsi dan Kompromi Historis\nPada 22 Juni 1945, setelah melalui diskusi dan perdebatan yang intens, Panitia Sembilan berhasil mencapai kesepakatan dan menghasilkan naskah yang dinamakan 'Piagam Jakarta'. Inti dari naskah ini adalah rumusan lima asas dasar negara yang kemudian dikenal sebagai Pancasila, serta rancangan Pembukaan Undang-Undang Dasar. Rumusan sila pertamanya adalah titik krusial dari kompromi tersebut:\n\n1. Ketuhanan, dengan kewajiban menjalankan syariat Islam bagi pemeluk-pemeluknya.\n2. Kemanusiaan yang adil dan beradab.\n3. Persatuan Indonesia.\n4. Kerakyatan yang dipimpin oleh hikmat, kebijaksanaan dalam permusyawaratan/perwakilan.\n5. Keadilan sosial bagi seluruh rakyat Indonesia.\n\nPerubahan 'Tujuh Kata' dan Pengesahan\nPasca Proklamasi Kemerdekaan pada 17 Agustus 1945, delegasi dari wilayah Indonesia bagian Timur, khususnya dari kalangan Kristen, menyampaikan keberatan atas frasa 'dengan kewajiban menjalankan syariat Islam bagi pemeluk-pemeluknya' pada sila pertama. Mereka berpendapat bahwa frasa tersebut tidak mencerminkan persatuan dan kesetaraan semua warga negara di Indonesia yang majemuk dan dikhawatirkan dapat memicu perpecahan bangsa yang baru merdeka.\n\nAtas inisiatif Drs. Mohammad Hatta dan tokoh-tokoh lainnya, segera diadakan pertemuan darurat. Demi menjaga persatuan dan keutuhan bangsa, disepakati untuk menghapus 'tujuh kata' tersebut. Pada tanggal 18 Agustus 1945, sehari setelah Proklamasi, frasa tersebut diubah menjadi 'Ketuhanan Yang Maha Esa'. Dengan perubahan ini, Piagam Jakarta (yang telah dimurnikan) secara resmi disahkan oleh Panitia Persiapan Kemerdekaan Indonesia (PPKI) sebagai Pembukaan Undang-Undang Dasar 1945. Keputusan ini dianggap sebagai salah satu tindakan politik paling bijaksana dalam sejarah Indonesia untuk menjamin berdirinya negara kesatuan yang bersatu.\n\nNaskah Piagam Jakarta, meski sebagian rumusan awalnya diubah, tetap diakui sebagai dokumen historis yang tidak terpisahkan dari proses pembentukan UUD 1945 dan Pancasila." ,
    "imageURL": "https://awsimages.detik.net.id/community/media/visual/2017/06/01/1cd906c8-df74-46c5-b3d5-70079b9dafda.jpg?w=1200",
    "category": "Sejarah Konstitusi",
    "tags": ["Piagam Jakarta", "BPUPKI", "Panitia Sembilan", "Pancasila", "UUD 1945", "22 Juni", "Kompromi Nasional"],
    "quote": "Tiap-tiap manusia mempunyai hak untuk hidup, hak untuk diperlindungi, hak untuk merdeka, hak untuk bahagia, hak untuk berusaha.",
    "location": "Jakarta",
    "isCollage": true,
    "galleryImages": [
      "https://asset-2.tribunnews.com/makassar/foto/bank/originals/hasim0723062021.jpg",
      "https://assets.pikiran-rakyat.com/crop/15x51:1171x717/720x0/webp/photo/2025/06/01/1040083536.jpg",
      "https://awsimages.detik.net.id/community/media/visual/2021/07/17/sidang-bpupki.jpeg?w=600&q=90"
    ]
},
{
    "slug": "hari-koperasi-nasional-12-juli",
    "title": "Hari Koperasi Indonesia",
    "date": "1947-07-12",
    "shortDescription": "Peringatan diselenggarakannya Kongres Koperasi Nasional Pertama di Tasikmalaya pada 12 Juli 1947, yang menegaskan koperasi sebagai soko guru perekonomian bangsa.",
    "description": "Hari Koperasi Indonesia diperingati setiap tanggal 12 Juli untuk mengenang momentum bersejarah Kongres Koperasi Nasional Pertama (I) yang diselenggarakan di Tasikmalaya, Jawa Barat, pada tahun 1947. Kongres ini diadakan hanya dua tahun setelah Indonesia merdeka, menunjukkan betapa pentingnya peran koperasi dalam membangun fondasi ekonomi nasional yang adil dan berlandaskan kekeluargaan, sesuai dengan amanat Pasal 33 Undang-Undang Dasar (UUD) 1945.\n\nSejarah gerakan koperasi di Indonesia sebenarnya sudah dimulai jauh sebelum kemerdekaan. Cikal bakal koperasi modern di Indonesia dirintis oleh R. Aria Wirjaatmadja di Purwokerto pada akhir abad ke-19. Namun, Kongres di Tasikmalaya pada 12 Juli 1947 inilah yang secara resmi menetapkan arah gerakan koperasi di masa Republik Indonesia. Dalam kongres tersebut, disepakati beberapa keputusan penting, antara lain mendirikan Sentral Organisasi Koperasi Rakyat Indonesia (SOKRI), menetapkan gotong royong sebagai asas koperasi, dan menetapkan tanggal 12 Juli sebagai Hari Koperasi yang harus diperingati setiap tahun. Penetapan ini kemudian diperkuat melalui Keputusan Presiden (KEPPRES) Nomor 127 Tahun 1964.\n\nTokoh Kunci: Mohammad Hatta, Bapak Koperasi Indonesia\nMohammad Hatta, Wakil Presiden pertama Republik Indonesia, adalah tokoh sentral di balik ideologi dan perkembangan koperasi di Indonesia. Sejak menempuh pendidikan di Belanda, Hatta sudah menaruh perhatian besar pada konsep ekonomi kolektif dan kerakyatan. Ia percaya bahwa koperasi adalah pilar utama dalam membangun sistem ekonomi yang dapat membebaskan rakyat kecil dari eksploitasi ekonomi kolonial.\n\nKonsistensi Hatta dalam mempromosikan dan mengembangkan gerakan koperasi, baik melalui tulisan, ceramah, maupun kebijakan, membuatnya dianugerahi gelar 'Bapak Koperasi Indonesia'. Gelar ini diberikan saat Kongres Koperasi Indonesia di Bandung pada tanggal 17 Juli 1953. Bagi Hatta, koperasi bukan sekadar organisasi ekonomi, melainkan juga wadah pendidikan moral dan demokrasi ekonomi. Kutipannya yang terkenal menegaskan bahwa 'Koperasi adalah usaha bersama untuk memperbaiki nasib penghidupan ekonomi berdasarkan tolong-menolong'.\n\nFakta Unik Mohammad Hatta Terkait Koperasi\nFakta menarik mengenai Bung Hatta yang jarang diketahui publik adalah bagaimana beliau menunjukkan komitmennya pada prinsip ekonomi kerakyatan dan kesederhanaan, bahkan setelah menjadi Wakil Presiden. Hatta pernah mengembalikan dana taktis Wakil Presiden yang sebenarnya merupakan haknya, menunjukkan integritas dan penolakannya terhadap pemborosan. Selain itu, Hatta pernah menunaikan ibadah haji bersama istri dan keluarganya menggunakan uang yang seluruhnya berasal dari honorarium hasil menulis buku-buku ekonomi dan koperasi, bukan menggunakan uang negara. Komitmennya yang unik ini, termasuk janji untuk tidak menikah sebelum Indonesia merdeka, menegaskan dedikasinya yang totalitas pada perjuangan bangsa, termasuk perjuangan ekonomi melalui koperasi.",
    "imageURL": "https://imgsrv2.voi.id/uEjLv8lF59l5inaK15X5z8ETI3dFRgPeCoXOUShVbDU/auto/1200/675/sm/1/bG9jYWw6Ly8vcHVibGlzaGVycy82NjMzMC8yMDIxMDcxMjE0MTEtbWFpbi5jcm9wcGVkXzE2MjYwNzM4ODYuanBlZw.jpg",
    "category": "Peristiwa Nasional",
    "tags": ["Koperasi", "Mohammad Hatta", "Bung Hatta", "12 Juli", "Ekonomi Kerakyatan", "Tasikmalaya"],
    "quote": "Koperasi adalah usaha bersama untuk memperbaiki nasib penghidupan ekonomi berdasarkan tolong-menolong.",
    "location": "Tasikmalaya, Jawa Barat",
    "isCollage": true,
    "galleryImages": [
      "https://image.idntimes.com/post/20190711/5-f21d0feffea0c51b66e19b8034af4da7.jpg",
      "https://awsimages.detik.net.id/community/media/visual/2021/03/11/hari-ini-41-tahun-bung-hatta-wafat-1.jpeg?w=650",
      "https://www.mcmnews.id/wp-content/uploads/2022/07/Pink-Heart-Balloons-Boyfriend-Birthday-Card-1.png"
    ]
},
{
    "slug": "peristiwa-rengasdengklok-dan-proklamasi-1945",
    "title": "Rengasdengklok dan Proklamasi Kemerdekaan",
    "date": "1945-08-16",
    "shortDescription": "Peristiwa penculikan Soekarno-Hatta ke Rengasdengklok pada 16 Agustus 1945, yang mendahului perumusan naskah dan pembacaan Proklamasi Kemerdekaan Indonesia pada 17 Agustus 1945.",
    "description": "Peristiwa Rengasdengklok dan Proklamasi Kemerdekaan adalah dua momen yang saling terkait dan krusial dalam sejarah berdirinya Republik Indonesia. Semua bermula dari berita kekalahan Jepang terhadap Sekutu pada 14 Agustus 1945, yang diketahui oleh para pemuda Indonesia melalui siaran radio luar negeri.\n\nPerbedaan pandangan langsung muncul antara 'Golongan Tua' (diwakili oleh Soekarno dan Hatta) dan 'Golongan Muda' (diwakili oleh Chaerul Saleh, Sukarni, Wikana, dan lain-lain). Golongan Tua ingin Proklamasi diselenggarakan melalui prosedur resmi Panitia Persiapan Kemerdekaan Indonesia (PPKI), yang dianggap sebagai badan bentukan Jepang. Sementara Golongan Muda, didorong oleh semangat radikal, mendesak agar Proklamasi segera dilaksanakan saat itu juga tanpa campur tangan Jepang sedikit pun, karena Indonesia telah merdeka atas kekuatan dan perjuangan bangsa sendiri.\n\nRengasdengklok: Penculikan dan Diplomasi\nKarena Soekarno dan Hatta bersikeras dengan sikap kehati-hatian mereka, Golongan Muda memutuskan untuk mengambil tindakan dramatis. Pada dini hari, 16 Agustus 1945, Soekarno dan Hatta diculik dan dibawa ke Rengasdengklok, sebuah desa terpencil di Karawang, Jawa Barat. Tujuan utama penculikan ini bukan untuk menyakiti, melainkan untuk menjauhkan kedua pemimpin tersebut dari pengaruh Jepang, sekaligus meyakinkan mereka bahwa kemerdekaan harus diproklamasikan atas nama rakyat Indonesia secepatnya.\n\nSetelah melalui negosiasi yang alot dan perantara dari Achmad Soebardjo, disepakati bahwa Proklamasi akan dilakukan pada hari berikutnya. Soebardjo menjamin dengan taruhan nyawanya bahwa Proklamasi akan terlaksana selambat-lambatnya pukul 12.00 WIB, 17 Agustus 1945. Soekarno dan Hatta pun akhirnya dibawa kembali ke Jakarta pada malam hari.\n\nPerumusan Naskah Proklamasi\nSetibanya di Jakarta, perumusan naskah Proklamasi dilakukan di rumah Laksamana Tadashi Maeda, seorang perwira tinggi Angkatan Laut Jepang yang bersimpati kepada perjuangan Indonesia, di Jalan Imam Bonjol No. 1. Naskah Proklamasi dirumuskan oleh tiga tokoh utama: Soekarno, Hatta, dan Achmad Soebardjo, disaksikan oleh Golongan Muda. Setelah naskah selesai, Soekarno mengajukan ide agar semua yang hadir menandatangani naskah tersebut, tetapi Sukarni (Golongan Muda) mengusulkan agar naskah cukup ditandatangani oleh Soekarno dan Hatta saja atas nama bangsa Indonesia. Mohammad Hatta kemudian menyarankan perubahan dari 'Wakil-wakil bangsa Indonesia' menjadi 'Atas nama bangsa Indonesia, Soekarno/Hatta'.\n\nProklamasi Kemerdekaan\nPada pagi hari, 17 Agustus 1945, pukul 10.00 WIB, di kediaman Soekarno di Jalan Pegangsaan Timur No. 56 (sekarang Jl. Proklamasi), naskah Proklamasi dibacakan oleh Soekarno didampingi Mohammad Hatta. Setelah pembacaan, bendera Merah Putih yang dijahit oleh Fatmawati (istri Soekarno) dikibarkan, diikuti dengan lagu kebangsaan 'Indonesia Raya'. Peristiwa ini menandai lahirnya Negara Kesatuan Republik Indonesia ke seluruh dunia dan menjadi puncak dari perjuangan panjang bangsa Indonesia.",
    "imageURL": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQO6a7qGP3bzXSNeHB_flJ4KL8uIBISRW3x6Q&s",
    "category": "Peristiwa Nasional",
    "tags": ["Proklamasi", "17 Agustus 1945", "Rengasdengklok", "Soekarno", "Hatta", "Pahlawan Nasional"],
    "quote": "Proklamasi: Kami bangsa Indonesia dengan ini menjatakan kemerdekaan Indonesia.",
    "location": "Jakarta dan Rengasdengklok, Karawang",
    "isCollage": true,
    "galleryImages": [
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSdnhAD8u4BDgcj5wUvJuh_DkBrbVizZ7dCnw&s",
      "https://asset.kompas.com/crops/6gqzinZOi5Qqe5MOnBDLpip6RkQ=/0x44:640x471/1200x800/data/photo/2022/04/09/62510c34e22d3.jpg",
      "https://blue.kumparan.com/image/upload/fl_progressive,fl_lossy,c_fill,f_auto,q_auto:best,w_640/v1628498183/ozwba7kox9kimvlbzfo7.jpg"
    ]
},
 {
    "slug": "g30s-pki-1965",
    "title": "Gerakan 30 September (G30S/PKI)",
    "date": "1965-09-30",
    "shortDescription": "Peristiwa penculikan dan pembunuhan enam jenderal TNI Angkatan Darat yang dituduh terkait dengan Partai Komunis Indonesia (PKI), berujung pada penumpasan PKI dan peralihan kekuasaan Orde Lama ke Orde Baru.",
    "description": "Latar Belakang\nDominasi ideologi Nasakom: Sejak era Demokrasi Terpimpin (1959-1965), Presiden Soekarno berupaya menyeimbangkan ideologi nasionalisme, agama, dan komunisme (Nasakom).\n\nKetidakharmonisan TNI-PKI: Terdapat ketegangan dan persaingan antara anggota TNI dan PKI, dengan kelompok anti-komunis yang mencurigai penyebaran ideologi komunis oleh PKI.\n\nIsu kesehatan Soekarno: Kondisi kesehatan Presiden Soekarno yang menurun dan spekulasi seputar Dewan Jenderal Angkatan Darat memicu kecemasan dan menjadi salah satu faktor pemicu gerakan ini. \n\nKronologi\nPeristiwa utama: Pada malam 30 September hingga 1 Oktober 1965, sekelompok pasukan yang dipimpin oleh Letkol Untung melancarkan aksi penculikan enam jenderal TNI AD.\n\nAksi di Jakarta: Gerakan ini bertujuan menggulingkan pemerintahan Presiden Soekarno dan menggantinya dengan rezim yang lebih pro-komunis.\n\nNasib para jenderal: Enam jenderal yang diculik dibunuh, tiga di antaranya tewas di rumah mereka dan tiga lainnya dibawa ke Lubang Buaya.\n\nTokoh Kunci\nDN Aidit: Ketua Partai Komunis Indonesia (PKI) yang menjadi pemimpin utama gerakan ini.\n\nLetkol Untung: Komandan Batalyon 1 Pasukan Pengawal Istana (Cakrabirawa) yang memimpin aksi penangkapan para jenderal. \n\nDampak dan Akibat\nKematian tujuh perwira: Tujuh perwira tinggi TNI AD dan satu perwira menjadi korban, termasuk Letjen Ahmad Yani, Mayjen Suprapto, Mayjen Haryono, Mayjen Parman, Brigjen Panjaitan, Brigjen Sutoyo Siswomiharjo, dan Lettu Pierre Andreas Tendean (ajudan Jenderal Nasution).\n\nPenumpasan PKI: Setelah peristiwa ini, terjadi penumpasan terhadap PKI dan para pendukungnya, yang menyebabkan perubahan besar dalam tatanan politik Indonesia.\n\nAlat propaganda: Pada era Orde Baru, film propaganda berjudul \"Penumpasan Pengkhianatan G 30 S PKI\" diproduksi dan diputar setiap tahun pada tanggal 30 September.\n\nPenguasaan Soeharto: Peristiwa G30S PKI menjadi awal mula melemahnya kekuasaan Soekarno dan konsolidasi kekuasaan Orde Baru di bawah kepemimpinan Soeharto.",
    "imageURL": "../img/september/1.jpg",
    "category": "Politik & Konflik",
    "tags": ["G30S/PKI", "1965", "Soekarno", "Soeharto", "PKI", "Nasakom", "Pahlawan Revolusi"],
    "quote": "Peristiwa G30S/PKI menjadi awal mula melemahnya kekuasaan Soekarno dan konsolidasi kekuasaan Orde Baru di bawah kepemimpinan Soeharto.",
    "location": "Jakarta",
    "isCollage": true,
    "galleryImages": [
      "../img/september/2.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSAIYY1VeXfya-dJDgeoHKY0TlYjBW6pGbGrw&s",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQVLyinbRTsKCJVLCPpAQIK0Ujh7F0c0NBs-Q&s"
    ]
  },
  {
    "slug": "sumpah-pemuda-1928",
    "title": "Sumpah Pemuda",
    "date": "1928-10-28",
    "shortDescription": "Ikrar penting yang diucapkan pada Kongres Pemuda Kedua 28 Oktober 1928, menetapkan satu tanah air, satu bangsa, dan satu bahasa: Indonesia.",
    "description": "PERISTIWA SUMPAH PEMUDA\nRangkuman Sumpah Pemuda\nSumpah Pemuda adalah ikrar penting yang diucapkan oleh para pemuda dan pemudi pada tanggal 28 Oktober 1928, melalui keputusan Kongres Pemuda Kedua. Ikrar ini menetapkan jati diri bangsa Indonesia dengan menegaskan tiga dasar utama: satu tanah air, satu bangsa, dan satu bahasa. Rumusan tersebut kemudian menjadi fondasi persatuan nasional dan identitas kebangsaan yang krusial dalam perjuangan kemerdekaan Indonesia. Wikipedia\nSejarah & Latar Belakang\nKongres Pemuda Kedua digagas oleh Perhimpunan Pelajar-Pelajar Indonesia (PPPI), yang terdiri dari pelajar pemuda dari seluruh wilayah Hindia Belanda saat itu. bpmpriau.kemendikdasmen.go.id\nSebelum kongres, diadakan pertemuan persiapan pada tanggal 3 Mei dan 12 Agustus 1928, untuk membahas pembentukan panitia, susunan acara, lokasi, dan pendanaan. muspada.kemenbud.go.id\nKongres dilaksanakan selama dua hari (27–28 Oktober 1928) di tiga gedung berbeda: rapat pertama di Gedung Katholieke Jongenlingen Bond, rapat kedua di Gedung Oost Java Bioscoop, dan rapat penutup di Gedung Indonesische Clubgebouw (sekarang Jalan Kramat Raya 106, Jakarta). bpmpriau.kemendikdasmen.go.id\nSelama rapat pertama, ketua PPPI, Soegondo Djojopuspito, menyampaikan harapan agar pemuda dari berbagai latar belakang bisa bersatu. Di sesi ini, Mohammad Yamin mengemukakan lima faktor yang dapat memperkuat persatuan nasional yaitu: sejarah, bahasa, hukum adat, pendidikan, dan kemauan. bpmpriau.kemendikdasmen.go.id\nPada rapat kedua, pembahasan fokus pada pendidikan. Pembicara seperti Poernomowoelan dan Sarmidi Mangoensarkoro menyatakan bahwa pendidikan bagi anak-anak harus bersifat kebangsaan, seimbang antara sekolah dan rumah, dan bersifat demokratis. detiknews\nRapat ketiga, yaitu rapat penutup, terjadi di gedung Kramat. Di sesi ini, tokoh seperti Sunario menekankan nasionalisme dan demokrasi, sementara Ramelan menyoroti peranan gerakan kepanduan (pramuka) dalam memperkuat karakter pemuda. Setelah itu, dibacakan naskah ikrar (Sumpah Pemuda) dan diperdengarkan lagu “Indonesia Raya” ciptaan Wage Rudolf Supratman. bpmpriau.kemendikdasmen.go.id\nIsi Ikrar Sumpah Pemuda\nRumusan Sumpah Pemuda terdiri dari tiga butir sebagai berikut:\nKami putra dan putri Indonesia, mengaku bertumpah darah yang satu, tanah air Indonesia. Wikipedia\nKami putra dan putri Indonesia, mengaku berbangsa yang satu, bangsa Indonesia. Wikipedia\nKami putra dan putri Indonesia, menjunjung bahasa persatuan, bahasa Indonesia. Wikipedia\nTeks ini pada awalnya ditulis oleh Mohammad Yamin di selembar kertas, dan kemudian dibacakan oleh Soegondo Djojopuspito. disdik.bekasikota.go.id\nMakna & Implikasi\nIkrar ini menjadi simbol persatuan nasional, karena dirumuskan oleh pemuda dari berbagai suku, agama, dan daerah. Kompas\nSumpah Pemuda kemudian dijadikan asas untuk semua organisasi kebangsaan di Indonesia, sebagai landasan untuk semangat nasionalisme dan persatuan. muspada.kemenbud.go.id\nSemangat dalam ikrar ini juga memperkuat kesadaran tentang pentingnya bahasa Indonesia sebagai alat pemersatu bangsa. muspada.kemenbud.go.id\nWarisan & Peringatan\nTempat di mana ikrar dibacakan (Jalan Kramat Raya No. 106) sekarang menjadi Museum Sumpah Pemuda. Wikipedia\nMuseum tersebut menyimpan artefak penting dari peristiwa Kongres Pemuda II dan Sumpah Pemuda, seperti dokumen, foto, dan benda bersejarah. Wikipedia\nSumpah Pemuda diperingati tiap 28 Oktober sebagai hari nasional karena perannya sebagai tonggak perjuangan kemerdekaan. Wikipedia\nIstilah “Sumpah Pemuda” sendiri muncul setelah kongres, bukan bagian dari perumusan awal keputusan. disdik.bekasikota.go.id\nAnalisis Dampak Sumpah Pemuda terhadap Perkembangan Indonesia Modern\nDampak terhadap Identitas Nasional\nSumpah pemuda memperkuat konsep bangsa indonesia sebagai satu kesatuan dan membangun rasa kebersamaan di tengah keberagaman.\nDampak terhadap Bahasa Indonesia sebagai Bahasa Persatuan\nMenjadi titik awal bahasa indonesia dipakai sebagai bahasa nasional dan berkembang jadi bahasa utama pendidikan, pemerintahan, dan teknologi.\nDampak terhadap Pendidikan Nasional\nMempengaruhi arah pendidikan untuk membentuk karakter persatuan dan pemerataan, termasuk program nasional seperti wajib belajar dan kurikulum.\nDampak terhadap Gerakan Politik dan Demokrasi\nMemperkuat gerakan politik menuju kemerdekaan dan menjadi dasar perilaku demokrasi yang tetap berlandaskan persatuan.\nDampak terhadap Integrasi Sosial dan Kebhinekaan\nMenjadi simbol bahwa perbedaan adalah kekuatan, serta membantu meredam konflik dan mendorong toleransi.\nDampak terhadap Budaya dan Kreativitas Anak Muda\nMenginspirasi pemuda untuk berkarya dalam berbagai bidang, dari seni hingga teknologi dan gerakan sosial.\nDampak terhadap Teknologi dan Globalisasi\nBahasa indonesia mempermudah pengembangan ekosistem digital nasional dan menjaga persatuan menghadapi arus informasi global.\nDampak terhadap Relevansi Masa Kini\nNilai sumpah pemuda penting untuk melawan hoaks, polarisasi, intoleransi, dan memperkuat identitas bangsa di era modern.",
    "imageURL": "../img/oktober/2.jpg",
    "category": "Pergerakan Nasional",
    "tags": ["Sumpah Pemuda", "Kongres Pemuda II", "1928", "Mohammad Yamin", "Bahasa Indonesia", "Kramat Raya"],
    "quote": "Satu nusa, satu bangsa, satu bahasa. Indonesia.",
    "location": "Batavia (Jakarta)",
    "isCollage": true,
    "galleryImages": [
        "../img/oktober/1.jpg", 
        "https://images.tokopedia.net/img/JFrBQq/2022/10/13/117d6a9f-5a50-402b-a595-3592b435c87c.jpg",
        "https://images.tokopedia.net/img/KRMmCm/2022/10/13/a8926ad9-2bcd-40bc-be7d-28b524a071eb.jpg"
    ]
  },
  {
    "slug": "pertempuran-surabaya-1945",
    "title": "Pertempuran Surabaya",
    "date": "1945-11-10",
    "shortDescription": "Peristiwa heroik di Surabaya yang memicu pertempuran besar antara rakyat dan tentara Indonesia melawan pasukan Sekutu/Inggris, yang kemudian diperingati sebagai Hari Pahlawan.",
    "description": "Latar Belakang\nBerdasarkan sejarah yang ada, awal terjadinya Pertempuran Surabaya dilatarbelakangi dengan adanya kedatangan pasukan sekutu pada tanggal 25 Oktober 1945 yang tergabung dalam AFNEI atau Allied Forces Netherland East Indies. Kedatangan pasukan AFNEI  tersebut ke Surabaya tepatnya di Tanjung Perak dipimpin oleh seorang Jenderal yang bernama Brigadir Jenderal Aubertin Walter Sothern Mallaby yang kemudian membuat sebuah pos pertahanan.\n\nTujuan awal dari kedatangan sekutu tersebut adalah mengamankan tawanan perang, melucuti senjata para tentara Jepang serta menciptakan ketertiban setelah mengumandangkan kemerdekaan tersebut. Hal ini dilakukan oleh pasukan sekutu dengan menyebar selebaran yang memiliki maksud agar masyarakat setempat menyerahkan senjata yang mereka miliki ke pihak mereka.\n\nAdanya perintah pasukan sekutu tersebut membuat masyarakat setempat di Surabaya marah dan menolak untuk menyerahkan senjata yang mereka miliki kepada pihak sekutu tersebut. Hal ini yang pada akhirnya memicu adanya gerakan dari masyarakat Surabaya untuk melakukan penyerangan dengan maksud untuk mengusir pasukan sekutu tersebut.\n\nKronologi Pertempuran Surabaya 10 November\nPada 9 November 1945, Komandan Pertahanan Kota Sungkono mengumpulkan seluruh kekuatan di Surabaya di Markas Pregolan 4, termasuk TKR, BPRI, Polisi Istimewa, TKR Laut, Tentara Pelajar, BBI, dan PRI. Kota Surabaya dibagi menjadi tiga sektor pertahanan: sektor barat dipimpin Koenkiyat, sektor tengah oleh Marhadi, dan sektor timur oleh Kadim Prawirodiarjo.\n\nSetelah ultimatum Inggris berakhir, pertempuran besar pun pecah. Arek-arek Surabaya bertempur gigih selama hampir tiga minggu, meski menghadapi pasukan Inggris dengan senjata modern. Pertempuran terakhir terjadi di Gunungsari pada 28 November 1945, dan perlawanan masih terus berlangsung secara sporadis.\n\nMarkas pertahanan kemudian dipindahkan ke Markas Kali. Peristiwa ini menunjukkan keberanian luar biasa rakyat Surabaya, yang kemudian dikenang dengan peringatan Hari Pahlawan setiap 10 November.\n\nDampak\nRibuan pejuang dan rakyat gugur, tapi peristiwa ini membangkitkan semangat perlawanan di seluruh Indonesia.\nPemerintah Indonesia kemudian menetapkan 10 November sebagai Hari Pahlawan, untuk mengenang keberanian dan pengorbanan para pejuang Surabaya.\nInfrastruktur, Sosial dan Ekonomi Hancur\nMeningkatkan Semangat Nasionalisme\n\nTokoh\nBung Tomo (Sutomo): lewat siaran radionya, beliau membangkitkan semangat juang rakyat dengan pekikan \"Allahu Akbar!\" dan ajakan untuk tidak mundur.\nKH. Hasyim Asy’ari dan para ulama NU: mengeluarkan Resolusi Jihad yang mewajibkan umat Islam membela tanah air dari penjajah.",
    "imageURL": "../img/november/1.jpg",
    "category": "Perjuangan Kemerdekaan",
    "tags": ["10 November", "Hari Pahlawan", "Surabaya", "Bung Tomo", "AFNEI", "Mallaby"],
    "quote": "Merdeka atau mati!",
    "location": "Surabaya, Jawa Timur",
    "isCollage": true,
    "galleryImages": [
     "../img/november/2.jpg",
      "https://asset.kompas.com/crops/ZY21m82tb644PpI8FRJVQqCnw5o=/0x0:970x647/780x390/data/photo/2018/11/09/4182503970.JPG",
      "https://inca.ac.id/wp-content/uploads/2025/03/Pertempuran-Surabaya.webp"
    ]
  },
  {
    "slug": "pengakuan-kedaulatan-1949",
    "title": "Hari Pengakuan Kedaulatan Indonesia",
    "date": "1949-12-27",
    "shortDescription": "Tanggal resmi pengakuan kedaulatan Indonesia oleh Belanda melalui hasil Konferensi Meja Bundar (KMB), yang menandai berdirinya Republik Indonesia Serikat (RIS).",
    "description": "Latar Belakang\nSetelah proklamasi, Belanda tidak mau mengakui kemerdekaan Indonesia.\nMereka berusaha merebut kembali kekuasaan lewat agresi militer, yaitu:\nAgresi Militer Belanda I (21 Juli 1947)\nAgresi Militer Belanda II (19 Desember 1948)\nKedua agresi itu mendapat kecaman dari dunia internasional.\nAkhirnya, PBB turun tangan dan membentuk Komisi Tiga Negara (KTN) (Amerika Serikat, Australia, dan Belgia) untuk menengahi konflik.\nDari sinilah muncul upaya diplomasi Indonesia, salah satunya melalui Konferensi Meja Bundar (KMB).\n\nProses menuju Konferensi Meja Bundar (KMB)\nPersiapan menuju KMB dimulai dengan perundingan intensif antara Republik Indonesia (RI) dan Bijeenkomst voor Federaal Overleg (BFO), yang mewakili kelompok federal di Indonesia. Kesepakatan utama dari perundingan ini adalah pembentukan Republik Indonesia Serikat (RIS) sebagai bentuk negara federal yang menjadi basis negosiasi di KMB. \n\nPada 23 Agustus 1949, KMB resmi dibuka di Den Haag, Belanda. Delegasi Indonesia dipimpin oleh Mohammad Hatta, sedangkan pihak Belanda diwakili oleh Van Maarseven, dengan pengawasan dari United Nations Commission for Indonesia (UNCI). Selama lebih dari dua bulan, diskusi di KMB berlangsung alot. Dua isu utama yang memicu perdebatan adalah pembentukan Uni Indonesia-Belanda dan penyelesaian utang Hindia Belanda. \n\nAkhirnya, pada 2 November 1949, KMB mencapai kesepakatan. Salah satu poin penting adalah pengakuan Belanda atas kedaulatan Indonesia atau RIS pada akhir Desember 1949. Selain itu, kedua pihak sepakat untuk membentuk Uni Indonesia-Belanda dengan kedudukan yang setara serta membahas masalah Irian Barat setahun kemudian.\n\nPenyerahan Kedaulatan pada 27 Desember 1949\nPada tanggal 27 Desember 1949, peristiwa bersejarah ini berlangsung secara resmi di dua lokasi, yaitu Amsterdam dan Jakarta. Di Amsterdam, naskah penyerahan kedaulatan ditandatangani oleh Ratu Juliana dan Mohammad Hatta. Sementara itu, di Jakarta, penandatanganan dilakukan oleh AHJ Lovink dan Sri Sultan Hamengkubuwono IX. Momen ini menandai pengakuan internasional terhadap RIS sebagai negara berdaulat. \n\nPenyerahan ini juga diiringi dengan pembentukan pemerintahan sementara RIS. Soekarno diangkat sebagai Presiden RIS, sedangkan Mohammad Hatta menjabat sebagai Perdana Menteri. Kabinet RIS pun dibentuk untuk menjalankan pemerintahan negara federal yang terdiri dari 16 negara bagian. RIS mengadopsi Undang-Undang Dasar Sementara (UUDS) 1950 sebagai konstitusi awalnya.\n\nTokoh:\nDrs. Mohammad Hatta → wakil Indonesia dalam penandatanganan pengakuan Kedaulatan.\nRatu Juliana → menandatangani dokumen penyerahan kedaulatan mewakili Belanda.\nSri Sultan Hamengkubuwono IX → menerima penyerahan di Jakarta.",
    "imageURL": "../img/desember/1.jpg",
    "category": "Diplomasi & Kedaulatan",
    "tags": ["KMB", "27 Desember", "Mohammad Hatta", "Belanda", "RIS", "Pengakuan Kedaulatan"],
    "quote": "Pengakuan ini adalah puncak perjuangan diplomasi dan militer yang panjang.",
    "location": "Den Haag (Belanda) dan Jakarta",
    "isCollage": false,
    "galleryImages": [
       "../img/desember/2.jpg",
      "https://asset.kompas.com/crops/LFDJM6nPQ-zRlSy9dpOnN-gu7IQ=/203x156:823x569/1200x800/data/photo/2021/12/27/61c90c9f3cf42.png",
      "https://maulanusantara.wordpress.com/files/2008/12/websoeveriteitsoverdracht27.jpg"
    ]
  }
]